una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam7s512.h
#define AT91C_TWI_IER   ((AT91_REG *) 	0xFFFB8024) /* (TWI) Interrupt Enable Register*/
#define AT91C_TWI_IADR  ((AT91_REG *) 	0xFFFB800C) /* (TWI) Internal Address Register*/
#define AT91C_TWI_MMR   ((AT91_REG *) 	0xFFFB8004) /* (TWI) Master Mode Register*/
/* ========== Register definition for TC0 peripheral ========== */
#define AT91C_TC0_IMR   ((AT91_REG *) 	0xFFFA002C) /* (TC0) Interrupt Mask Register*/
#define AT91C_TC0_IER   ((AT91_REG *) 	0xFFFA0024) /* (TC0) Interrupt Enable Register*/
#define AT91C_TC0_RC    ((AT91_REG *) 	0xFFFA001C) /* (TC0) Register C*/
#define AT91C_TC0_RA    ((AT91_REG *) 	0xFFFA0014) /* (TC0) Register A*/
#define AT91C_TC0_CMR   ((AT91_REG *) 	0xFFFA0004) /* (TC0) Channel Mode Register (Capture Mode / Waveform Mode)*/
#define AT91C_TC0_IDR   ((AT91_REG *) 	0xFFFA0028) /* (TC0) Interrupt Disable Register*/
#define AT91C_TC0_SR    ((AT91_REG *) 	0xFFFA0020) /* (TC0) Status Register*/
#define AT91C_TC0_RB    ((AT91_REG *) 	0xFFFA0018) /* (TC0) Register B*/
#define AT91C_TC0_CV    ((AT91_REG *) 	0xFFFA0010) /* (TC0) Counter Value*/
#define AT91C_TC0_CCR   ((AT91_REG *) 	0xFFFA0000) /* (TC0) Channel Control Register*/
/* ========== Register definition for TC1 peripheral ========== */
#define AT91C_TC1_IMR   ((AT91_REG *) 	0xFFFA006C) /* (TC1) Interrupt Mask Register*/
#define AT91C_TC1_IER   ((AT91_REG *) 	0xFFFA0064) /* (TC1) Interrupt Enable Register*/
#define AT91C_TC1_RC    ((AT91_REG *) 	0xFFFA005C) /* (TC1) Register C*/
#define AT91C_TC1_RA    ((AT91_REG *) 	0xFFFA0054) /* (TC1) Register A*/
#define AT91C_TC1_CMR   ((AT91_REG *) 	0xFFFA0044) /* (TC1) Channel Mode Register (Capture Mode / Waveform Mode)*/
#define AT91C_TC1_IDR   ((AT91_REG *) 	0xFFFA0068) /* (TC1) Interrupt Disable Register*/
#define AT91C_TC1_SR    ((AT91_REG *) 	0xFFFA0060) /* (TC1) Status Register*/
#define AT91C_TC1_RB    ((AT91_REG *) 	0xFFFA0058) /* (TC1) Register B*/
#define AT91C_TC1_CV    ((AT91_REG *) 	0xFFFA0050) /* (TC1) Counter Value*/
#define AT91C_TC1_CCR   ((AT91_REG *) 	0xFFFA0040) /* (TC1) Channel Control Register*/
/* ========== Register definition for TC2 peripheral ========== */
#define AT91C_TC2_IMR   ((AT91_REG *) 	0xFFFA00AC) /* (TC2) Interrupt Mask Register*/
#define AT91C_TC2_IER   ((AT91_REG *) 	0xFFFA00A4) /* (TC2) Interrupt Enable Register*/
#define AT91C_TC2_RC    ((AT91_REG *) 	0xFFFA009C) /* (TC2) Register C*/
#define AT91C_TC2_RA    ((AT91_REG *) 	0xFFFA0094) /* (TC2) Register A*/
#define AT91C_TC2_CMR   ((AT91_REG *) 	0xFFFA0084) /* (TC2) Channel Mode Register (Capture Mode / Waveform Mode)*/
#define AT91C_TC2_IDR   ((AT91_REG *) 	0xFFFA00A8) /* (TC2) Interrupt Disable Register*/
#define AT91C_TC2_SR    ((AT91_REG *) 	0xFFFA00A0) /* (TC2) Status Register*/
#define AT91C_TC2_RB    ((AT91_REG *) 	0xFFFA0098) /* (TC2) Register B*/
#define AT91C_TC2_CV    ((AT91_REG *) 	0xFFFA0090) /* (TC2) Counter Value*/
#define AT91C_TC2_CCR   ((AT91_REG *) 	0xFFFA0080) /* (TC2) Channel Control Register*/
/* ========== Register definition for TCB peripheral ========== */
#define AT91C_TCB_BMR   ((AT91_REG *) 	0xFFFA00C4) /* (TCB) TC Block Mode Register*/
#define AT91C_TCB_BCR   ((AT91_REG *) 	0xFFFA00C0) /* (TCB) TC Block Control Register*/
/* ========== Register definition for PWMC_CH3 peripheral ========== */
#define AT91C_PWMC_CH3_CUPDR ((AT91_REG *) 	0xFFFCC270) /* (PWMC_CH3) Channel Update Register*/
#define AT91C_PWMC_CH3_CPRDR ((AT91_REG *) 	0xFFFCC268) /* (PWMC_CH3) Channel Period Register*/
#define AT91C_PWMC_CH3_CMR ((AT91_REG *) 	0xFFFCC260) /* (PWMC_CH3) Channel Mode Register*/
#define AT91C_PWMC_CH3_Reserved ((AT91_REG *) 	0xFFFCC274) /* (PWMC_CH3) Reserved*/
#define AT91C_PWMC_CH3_CCNTR ((AT91_REG *) 	0xFFFCC26C) /* (PWMC_CH3) Channel Counter Register*/
#define AT91C_PWMC_CH3_CDTYR ((AT91_REG *) 	0xFFFCC264) /* (PWMC_CH3) Channel Duty Cycle Register*/
/* ========== Register definition for PWMC_CH2 peripheral ========== */
#define AT91C_PWMC_CH2_CUPDR ((AT91_REG *) 	0xFFFCC250) /* (PWMC_CH2) Channel Update Register*/
#define AT91C_PWMC_CH2_CPRDR ((AT91_REG *) 	0xFFFCC248) /* (PWMC_CH2) Channel Period Register*/
#define AT91C_PWMC_CH2_CMR ((AT91_REG *) 	0xFFFCC240) /* (PWMC_CH2) Channel Mode Register*/
#define AT91C_PWMC_CH2_Reserved ((AT91_REG *) 	0xFFFCC254) /* (PWMC_CH2) Reserved*/
#define AT91C_PWMC_CH2_CCNTR ((AT91_REG *) 	0xFFFCC24C) /* (PWMC_CH2) Channel Counter Register*/
#define AT91C_PWMC_CH2_CDTYR ((AT91_REG *) 	0xFFFCC244) /* (PWMC_CH2) Channel Duty Cycle Register*/
/* ========== Register definition for PWMC_CH1 peripheral ========== */
#define AT91C_PWMC_CH1_CUPDR ((AT91_REG *) 	0xFFFCC230) /* (PWMC_CH1) Channel Update Register*/
#define AT91C_PWMC_CH1_CPRDR ((AT91_REG *) 	0xFFFCC228) /* (PWMC_CH1) Channel Period Register*/
#define AT91C_PWMC_CH1_CMR ((AT91_REG *) 	0xFFFCC220) /* (PWMC_CH1) Channel Mode Register*/
#define AT91C_PWMC_CH1_Reserved ((AT91_REG *) 	0xFFFCC234) /* (PWMC_CH1) Reserved*/
#define AT91C_PWMC_CH1_CCNTR ((AT91_REG *) 	0xFFFCC22C) /* (PWMC_CH1) Channel Counter Register*/
#define AT91C_PWMC_CH1_CDTYR ((AT91_REG *) 	0xFFFCC224) /* (PWMC_CH1) Channel Duty Cycle Register*/
/* ========== Register definition for PWMC_CH0 peripheral ========== */
#define AT91C_PWMC_CH0_CUPDR ((AT91_REG *) 	0xFFFCC210) /* (PWMC_CH0) Channel Update Register*/
#define AT91C_PWMC_CH0_CPRDR ((AT91_REG *) 	0xFFFCC208) /* (PWMC_CH0) Channel Period Register*/
#define AT91C_PWMC_CH0_CMR ((AT91_REG *) 	0xFFFCC200) /* (PWMC_CH0) Channel Mode Register*/
#define AT91C_PWMC_CH0_Reserved ((AT91_REG *) 	0xFFFCC214) /* (PWMC_CH0) Reserved*/
#define AT91C_PWMC_CH0_CCNTR ((AT91_REG *) 	0xFFFCC20C) /* (PWMC_CH0) Channel Counter Register*/
#define AT91C_PWMC_CH0_CDTYR ((AT91_REG *) 	0xFFFCC204) /* (PWMC_CH0) Channel Duty Cycle Register*/
/* ========== Register definition for PWMC peripheral ========== */
#define AT91C_PWMC_VR   ((AT91_REG *) 	0xFFFCC0FC) /* (PWMC) PWMC Version Register*/
#define AT91C_PWMC_ISR  ((AT91_REG *) 	0xFFFCC01C) /* (PWMC) PWMC Interrupt Status Register*/
#define AT91C_PWMC_IDR  ((AT91_REG *) 	0xFFFCC014) /* (PWMC) PWMC Interrupt Disable Register*/
#define AT91C_PWMC_SR   ((AT91_REG *) 	0xFFFCC00C) /* (PWMC) PWMC Status Register*/
#define AT91C_PWMC_ENA  ((AT91_REG *) 	0xFFFCC004) /* (PWMC) PWMC Enable Register*/
#define AT91C_PWMC_IMR  ((AT91_REG *) 	0xFFFCC018) /* (PWMC) PWMC Interrupt Mask Register*/
#define AT91C_PWMC_MR   ((AT91_REG *) 	0xFFFCC000) /* (PWMC) PWMC Mode Register*/
#define AT91C_PWMC_DIS  ((AT91_REG *) 	0xFFFCC008) /* (PWMC) PWMC Disable Register*/
#define AT91C_PWMC_IER  ((AT91_REG *) 	0xFFFCC010) /* (PWMC) PWMC Interrupt Enable Register*/
/* ========== Register definition for UDP peripheral ========== */
#define AT91C_UDP_TXVC  ((AT91_REG *) 	0xFFFB0074) /* (UDP) Transceiver Control Register*/
#define AT91C_UDP_ISR   ((AT91_REG *) 	0xFFFB001C) /* (UDP) Interrupt Status Register*/
#define AT91C_UDP_IDR   ((AT91_REG *) 	0xFFFB0014) /* (UDP) Interrupt Disable Register*/
#define AT91C_UDP_CSR   ((AT91_REG *) 	0xFFFB0030) /* (UDP) Endpoint Control and Status Register*/
#define AT91C_UDP_RSTEP ((AT91_REG *) 	0xFFFB0028) /* (UDP) Reset Endpoint Register*/
#define AT91C_UDP_ICR   ((AT91_REG *) 	0xFFFB0020) /* (UDP) Interrupt Clear Register*/
#define AT91C_UDP_GLBSTATE ((AT91_REG *) 	0xFFFB0004) /* (UDP) Global State Register*/
#define AT91C_UDP_NUM   ((AT91_REG *) 	0xFFFB0000) /* (UDP) Frame Number Register*/
#define AT91C_UDP_FADDR ((AT91_REG *) 	0xFFFB0008) /* (UDP) Function Address Register*/
#define AT91C_UDP_IER   ((AT91_REG *) 	0xFFFB0010) /* (UDP) Interrupt Enable Register*/
#define AT91C_UDP_IMR   ((AT91_REG *) 	0xFFFB0018) /* (UDP) Interrupt Mask Register*/
#define AT91C_UDP_FDR   ((AT91_REG *) 	0xFFFB0050) /* (UDP) Endpoint FIFO Data Register*/

/* ******************************************************************************/
/*               PIO DEFINITIONS FOR AT91SAM7S512*/
/* ******************************************************************************/
#define AT91C_PIO_PA0        ((unsigned int) 1 <<  0) /* Pin Controlled by PA0*/
#define AT91C_PA0_PWM0     ((unsigned int) AT91C_PIO_PA0) /*  PWM Channel 0*/
#define AT91C_PA0_TIOA0    ((unsigned int) AT91C_PIO_PA0) /*  Timer Counter 0 Multipurpose Timer I/O Pin A*/
#define AT91C_PIO_PA1        ((unsigned int) 1 <<  1) /* Pin Controlled by PA1*/
#define AT91C_PA1_PWM1     ((unsigned int) AT91C_PIO_PA1) /*  PWM Channel 1*/
#define AT91C_PA1_TIOB0    ((unsigned int) AT91C_PIO_PA1) /*  Timer Counter 0 Multipurpose Timer I/O Pin B*/
#define AT91C_PIO_PA10       ((unsigned int) 1 << 10) /* Pin Controlled by PA10*/
#define AT91C_PA10_DTXD     ((unsigned int) AT91C_PIO_PA10) /*  DBGU Debug Transmit Data*/
#define AT91C_PA10_NPCS2    ((unsigned int) AT91C_PIO_PA10) /*  SPI Peripheral Chip Select 2*/
#define AT91C_PIO_PA11       ((unsigned int) 1 << 11) /* Pin Controlled by PA11*/
#define AT91C_PA11_NPCS0    ((unsigned int) AT91C_PIO_PA11) /*  SPI Peripheral Chip Select 0*/
#define AT91C_PA11_PWM0     ((unsigned int) AT91C_PIO_PA11) /*  PWM Channel 0*/
#define AT91C_PIO_PA12       ((unsigned int) 1 << 12) /* Pin Controlled by PA12*/
#define AT91C_PA12_MISO     ((unsigned int) AT91C_PIO_PA12) /*  SPI Master In Slave*/
#define AT91C_PA12_PWM1     ((unsigned int) AT91C_PIO_PA12) /*  PWM Channel 1*/
#define AT91C_PIO_PA13       ((unsigned int) 1 << 13) /* Pin Controlled by PA13*/
#define AT91C_PA13_MOSI     ((unsigned int) AT91C_PIO_PA13) /*  SPI Master Out Slave*/
#define AT91C_PA13_PWM2     ((unsigned int) AT91C_PIO_PA13) /*  PWM Channel 2*/
#define AT91C_PIO_PA14       ((unsigned int) 1 << 14) /* Pin Controlled by PA14*/
#define AT91C_PA14_SPCK     ((unsigned int) AT91C_PIO_PA14) /*  SPI Serial Clock*/
#define AT91C_PA14_PWM3     ((unsigned int) AT91C_PIO_PA14) /*  PWM Channel 3*/
#define AT91C_PIO_PA15       ((unsigned int) 1 << 15) /* Pin Controlled by PA15*/
#define AT91C_PA15_TF       ((unsigned int) AT91C_PIO_PA15) /*  SSC Transmit Frame Sync*/
#define AT91C_PA15_TIOA1    ((unsigned int) AT91C_PIO_PA15) /*  Timer Counter 1 Multipurpose Timer I/O Pin A*/
#define AT91C_PIO_PA16       ((unsigned int) 1 << 16) /* Pin Controlled by PA16*/
#define AT91C_PA16_TK       ((unsigned int) AT91C_PIO_PA16) /*  SSC Transmit Clock*/
#define AT91C_PA16_TIOB1    ((unsigned int) AT91C_PIO_PA16) /*  Timer Counter 1 Multipurpose Timer I/O Pin B*/
#define AT91C_PIO_PA17       ((unsigned int) 1 << 17) /* Pin Controlled by PA17*/
#define AT91C_PA17_TD       ((unsigned int) AT91C_PIO_PA17) /*  SSC Transmit data*/
#define AT91C_PA17_PCK1     ((unsigned int) AT91C_PIO_PA17) /*  PMC Programmable Clock Output 1*/
#define AT91C_PIO_PA18       ((unsigned int) 1 << 18) /* Pin Controlled by PA18*/
#define AT91C_PA18_RD       ((unsigned int) AT91C_PIO_PA18) /*  SSC Receive Data*/
#define AT91C_PA18_PCK2     ((unsigned int) AT91C_PIO_PA18) /*  PMC Programmable Clock Output 2*/
#define AT91C_PIO_PA19       ((unsigned int) 1 << 19) /* Pin Controlled by PA19*/
#define AT91C_PA19_RK       ((unsigned int) AT91C_PIO_PA19) /*  SSC Receive Clock*/
#define AT91C_PA19_FIQ      ((unsigned int) AT91C_PIO_PA19) /*  AIC Fast Interrupt Input*/
#define AT91C_PIO_PA2        ((unsigned int) 1 <<  2) /* Pin Controlled by PA2*/
#define AT91C_PA2_PWM2     ((unsigned int) AT91C_PIO_PA2) /*  PWM Channel 2*/
#define AT91C_PA2_SCK0     ((unsigned int) AT91C_PIO_PA2) /*  USART 0 Serial Clock*/
#define AT91C_PIO_PA20       ((unsigned int) 1 << 20) /* Pin Controlled by PA20*/
#define AT91C_PA20_RF       ((unsigned int) AT91C_PIO_PA20) /*  SSC Receive Frame Sync*/
#define AT91C_PA20_IRQ0     ((unsigned int) AT91C_PIO_PA20) /*  External Interrupt 0*/
#define AT91C_PIO_PA21       ((unsigned int) 1 << 21) /* Pin Controlled by PA21*/
#define AT91C_PA21_RXD1     ((unsigned int) AT91C_PIO_PA21) /*  USART 1 Receive Data*/
#define AT91C_PA21_PCK1     ((unsigned int) AT91C_PIO_PA21) /*  PMC Programmable Clock Output 1*/
#define AT91C_PIO_PA22       ((unsigned int) 1 << 22) /* Pin Controlled by PA22*/
#define AT91C_PA22_TXD1     ((unsigned int) AT91C_PIO_PA22) /*  USART 1 Transmit Data*/
#define AT91C_PA22_NPCS3    ((unsigned int) AT91C_PIO_PA22) /*  SPI Peripheral Chip Select 3*/
#define AT91C_PIO_PA23       ((unsigned int) 1 << 23) /* Pin Controlled by PA23*/
#define AT91C_PA23_SCK1     ((unsigned int) AT91C_PIO_PA23) /*  USART 1 Serial Clock*/
#define AT91C_PA23_PWM0     ((unsigned int) AT91C_PIO_PA23) /*  PWM Channel 0*/
#define AT91C_PIO_PA24       ((unsigned int) 1 << 24) /* Pin Controlled by PA24*/
#define AT91C_PA24_RTS1     ((unsigned int) AT91C_PIO_PA24) /*  USART 1 Ready To Send*/
#define AT91C_PA24_PWM1     ((unsigned int) AT91C_PIO_PA24) /*  PWM Channel 1*/
#define AT91C_PIO_PA25       ((unsigned int) 1 << 25) /* Pin Controlled by PA25*/
#define AT91C_PA25_CTS1     ((unsigned int) AT91C_PIO_PA25) /*  USART 1 Clear To Send*/
#define AT91C_PA25_PWM2     ((unsigned int) AT91C_PIO_PA25) /*  PWM Channel 2*/
#define AT91C_PIO_PA26       ((unsigned int) 1 << 26) /* Pin Controlled by PA26*/
#define AT91C_PA26_DCD1     ((unsigned int) AT91C_PIO_PA26) /*  USART 1 Data Carrier Detect*/
#define AT91C_PA26_TIOA2    ((unsigned int) AT91C_PIO_PA26) /*  Timer Counter 2 Multipurpose Timer I/O Pin A*/
#define AT91C_PIO_PA27       ((unsigned int) 1 << 27) /* Pin Controlled by PA27*/
#define AT91C_PA27_DTR1     ((unsigned int) AT91C_PIO_PA27) /*  USART 1 Data Terminal ready*/
#define AT91C_PA27_TIOB2    ((unsigned int) AT91C_PIO_PA27) /*  Timer Counter 2 Multipurpose Timer I/O Pin B*/
#define AT91C_PIO_PA28       ((unsigned int) 1 << 28) /* Pin Controlled by PA28*/
#define AT91C_PA28_DSR1     ((unsigned int) AT91C_PIO_PA28) /*  USART 1 Data Set ready*/
#define AT91C_PA28_TCLK1    ((unsigned int) AT91C_PIO_PA28) /*  Timer Counter 1 external clock input*/
#define AT91C_PIO_PA29       ((unsigned int) 1 << 29) /* Pin Controlled by PA29*/
#define AT91C_PA29_RI1      ((unsigned int) AT91C_PIO_PA29) /*  USART 1 Ring Indicator*/
#define AT91C_PA29_TCLK2    ((unsigned int) AT91C_PIO_PA29) /*  Timer Counter 2 external clock input*/
#define AT91C_PIO_PA3        ((unsigned int) 1 <<  3) /* Pin Controlled by PA3*/
#define AT91C_PA3_TWD      ((unsigned int) AT91C_PIO_PA3) /*  TWI Two-wire Serial Data*/
#define AT91C_PA3_NPCS3    ((unsigned int) AT91C_PIO_PA3) /*  SPI Peripheral Chip Select 3*/
#define AT91C_PIO_PA30       ((unsigned int) 1 << 30) /* Pin Controlled by PA30*/
#define AT91C_PA30_IRQ1     ((unsigned int) AT91C_PIO_PA30) /*  External Interrupt 1*/
#define AT91C_PA30_NPCS2    ((unsigned int) AT91C_PIO_PA30) /*  SPI Peripheral Chip Select 2*/
#define AT91C_PIO_PA31       ((unsigned int) 1 << 31) /* Pin Controlled by PA31*/
#define AT91C_PA31_NPCS1    ((unsigned int) AT91C_PIO_PA31) /*  SPI Peripheral Chip Select 1*/
#define AT91C_PA31_PCK2     ((unsigned int) AT91C_PIO_PA31) /*  PMC Programmable Clock Output 2*/
#define AT91C_PIO_PA4        ((unsigned int) 1 <<  4) /* Pin Controlled by PA4*/
#define AT91C_PA4_TWCK     ((unsigned int) AT91C_PIO_PA4) /*  TWI Two-wire Serial Clock*/
#define AT91C_PA4_TCLK0    ((unsigned int) AT91C_PIO_PA4) /*  Timer Counter 0 external clock input*/
#define AT91C_PIO_PA5        ((unsigned int) 1 <<  5) /* Pin Controlled by PA5*/
#define AT91C_PA5_RXD0     ((unsigned int) AT91C_PIO_PA5) /*  USART 0 Receive Data*/
#define AT91C_PA5_NPCS3    ((unsigned int) AT91C_PIO_PA5) /*  SPI Peripheral Chip Select 3*/
#define AT91C_PIO_PA6        ((unsigned int) 1 <<  6) /* Pin Controlled by PA6*/
#define AT91C_PA6_TXD0     ((unsigned int) AT91C_PIO_PA6) /*  USART 0 Transmit Data*/
#define AT91C_PA6_PCK0     ((unsigned int) AT91C_PIO_PA6) /*  PMC Programmable Clock Output 0*/
#define AT91C_PIO_PA7        ((unsigned int) 1 <<  7) /* Pin Controlled by PA7*/
#define AT91C_PA7_RTS0     ((unsigned int) AT91C_PIO_PA7) /*  USART 0 Ready To Send*/
#define AT91C_PA7_PWM3     ((unsigned int) AT91C_PIO_PA7) /*  PWM Channel 3*/
#define AT91C_PIO_PA8        ((unsigned int) 1 <<  8) /* Pin Controlled by PA8*/
#define AT91C_PA8_CTS0     ((unsigned int) AT91C_PIO_PA8) /*  USART 0 Clear To Send*/
#define AT91C_PA8_ADTRG    ((unsigned int) AT91C_PIO_PA8) /*  ADC External Trigger*/
#define AT91C_PIO_PA9        ((unsigned int) 1 <<  9) /* Pin Controlled by PA9*/
#define AT91C_PA9_DRXD     ((unsigned int) AT91C_PIO_PA9) /*  DBGU Debug Receive Data*/
#define AT91C_PA9_NPCS1    ((unsigned int) AT91C_PIO_PA9) /*  SPI Peripheral Chip Select 1*/

/* ******************************************************************************/
/*               PERIPHERAL ID DEFINITIONS FOR AT91SAM7S512*/
/* ******************************************************************************/
#define AT91C_ID_FIQ    ((unsigned int)  0) /* Advanced Interrupt Controller (FIQ)*/
#define AT91C_ID_SYS    ((unsigned int)  1) /* System Peripheral*/
#define AT91C_ID_PIOA   ((unsigned int)  2) /* Parallel IO Controller*/
#define AT91C_ID_3_Reserved ((unsigned int)  3) /* Reserved*/
#define AT91C_ID_ADC    ((unsigned int)  4) /* Analog-to-Digital Converter*/
#define AT91C_ID_SPI    ((unsigned int)  5) /* Serial Peripheral Interface*/
#define AT91C_ID_US0    ((unsigned int)  6) /* USART 0*/
#define AT91C_ID_US1    ((unsigned int)  7) /* USART 1*/
#define AT91C_ID_SSC    ((unsigned int)  8) /* Serial Synchronous Controller*/
#define AT91C_ID_TWI    ((unsigned int)  9) /* Two-Wire Interface*/
#define AT91C_ID_PWMC   ((unsigned int) 10) /* PWM Controller*/
#define AT91C_ID_UDP    ((unsigned int) 11) /* USB Device Port*/
#define AT91C_ID_TC0    ((unsigned int) 12) /* Timer Counter 0*/
#define AT91C_ID_TC1    ((unsigned int) 13) /* Timer Counter 1*/
#define AT91C_ID_TC2    ((unsigned int) 14) /* Timer Counter 2*/
#define AT91C_ID_15_Reserved ((unsigned int) 15) /* Reserved*/
#define AT91C_ID_16_Reserved ((unsigned int) 16) /* Reserved*/
#define AT91C_ID_17_Reserved ((unsigned int) 17) /* Reserved*/
#define AT91C_ID_18_Reserved ((unsigned int) 18) /* Reserved*/
#define AT91C_ID_19_Reserved ((unsigned int) 19) /* Reserved*/
#define AT91C_ID_20_Reserved ((unsigned int) 20) /* Reserved*/
#define AT91C_ID_21_Reserved ((unsigned int) 21) /* Reserved*/
#define AT91C_ID_22_Reserved ((unsigned int) 22) /* Reserved*/
#define AT91C_ID_23_Reserved ((unsigned int) 23) /* Reserved*/
#define AT91C_ID_24_Reserved ((unsigned int) 24) /* Reserved*/
#define AT91C_ID_25_Reserved ((unsigned int) 25) /* Reserved*/
#define AT91C_ID_26_Reserved ((unsigned int) 26) /* Reserved*/
#define AT91C_ID_27_Reserved ((unsigned int) 27) /* Reserved*/
#define AT91C_ID_28_Reserved ((unsigned int) 28) /* Reserved*/
#define AT91C_ID_29_Reserved ((unsigned int) 29) /* Reserved*/
#define AT91C_ID_IRQ0   ((unsigned int) 30) /* Advanced Interrupt Controller (IRQ0)*/
#define AT91C_ID_IRQ1   ((unsigned int) 31) /* Advanced Interrupt Controller (IRQ1)*/
#define AT91C_ALL_INT   ((unsigned int) 0xC0007FF7) /* ALL VALID INTERRUPTS*/

/* ******************************************************************************/
/*               BASE ADDRESS DEFINITIONS FOR AT91SAM7S512*/
/* ******************************************************************************/
#define AT91C_BASE_SYS       ((AT91PS_SYS) 	0xFFFFF000) /* (SYS) Base Address*/
#define AT91C_BASE_AIC       ((AT91PS_AIC) 	0xFFFFF000) /* (AIC) Base Address*/
#define AT91C_BASE_PDC_DBGU  ((AT91PS_PDC) 	0xFFFFF300) /* (PDC_DBGU) Base Address*/
#define AT91C_BASE_DBGU      ((AT91PS_DBGU) 	0xFFFFF200) /* (DBGU) Base Address*/
#define AT91C_BASE_PIOA      ((AT91PS_PIO) 	0xFFFFF400) /* (PIOA) Base Address*/
#define AT91C_BASE_CKGR      ((AT91PS_CKGR) 	0xFFFFFC20) /* (CKGR) Base Address*/
#define AT91C_BASE_PMC       ((AT91PS_PMC) 	0xFFFFFC00) /* (PMC) Base Address*/
#define AT91C_BASE_RSTC      ((AT91PS_RSTC) 	0xFFFFFD00) /* (RSTC) Base Address*/
#define AT91C_BASE_RTTC      ((AT91PS_RTTC) 	0xFFFFFD20) /* (RTTC) Base Address*/
#define AT91C_BASE_PITC      ((AT91PS_PITC) 	0xFFFFFD30) /* (PITC) Base Address*/
#define AT91C_BASE_WDTC      ((AT91PS_WDTC) 	0xFFFFFD40) /* (WDTC) Base Address*/
#define AT91C_BASE_VREG      ((AT91PS_VREG) 	0xFFFFFD60) /* (VREG) Base Address*/
#define AT91C_BASE_EFC0      ((AT91PS_EFC) 	0xFFFFFF60) /* (EFC0) Base Address*/
#define AT91C_BASE_EFC1      ((AT91PS_EFC) 	0xFFFFFF70) /* (EFC1) Base Address*/
#define AT91C_BASE_MC        ((AT91PS_MC) 	0xFFFFFF00) /* (MC) Base Address*/
#define AT91C_BASE_PDC_SPI   ((AT91PS_PDC) 	0xFFFE0100) /* (PDC_SPI) Base Address*/
#define AT91C_BASE_SPI       ((AT91PS_SPI) 	0xFFFE0000) /* (SPI) Base Address*/
#define AT91C_BASE_PDC_ADC   ((AT91PS_PDC) 	0xFFFD8100) /* (PDC_ADC) Base Address*/
#define AT91C_BASE_ADC       ((AT91PS_ADC) 	0xFFFD8000) /* (ADC) Base Address*/
#define AT91C_BASE_PDC_SSC   ((AT91PS_PDC) 	0xFFFD4100) /* (PDC_SSC) Base Address*/
#define AT91C_BASE_SSC       ((AT91PS_SSC) 	0xFFFD4000) /* (SSC) Base Address*/
#define AT91C_BASE_PDC_US1   ((AT91PS_PDC) 	0xFFFC4100) /* (PDC_US1) Base Address*/
#define AT91C_BASE_US1       ((AT91PS_USART) 	0xFFFC4000) /* (US1) Base Address*/
#define AT91C_BASE_PDC_US0   ((AT91PS_PDC) 	0xFFFC0100) /* (PDC_US0) Base Address*/
#define AT91C_BASE_US0       ((AT91PS_USART) 	0xFFFC0000) /* (US0) Base Address*/
#define AT91C_BASE_TWI       ((AT91PS_TWI) 	0xFFFB8000) /* (TWI) Base Address*/
#define AT91C_BASE_TC0       ((AT91PS_TC) 	0xFFFA0000) /* (TC0) Base Address*/
#define AT91C_BASE_TC1       ((AT91PS_TC) 	0xFFFA0040) /* (TC1) Base Address*/
#define AT91C_BASE_TC2       ((AT91PS_TC) 	0xFFFA0080) /* (TC2) Base Address*/
#define AT91C_BASE_TCB       ((AT91PS_TCB) 	0xFFFA0000) /* (TCB) Base Address*/
#define AT91C_BASE_PWMC_CH3  ((AT91PS_PWMC_CH) 	0xFFFCC260) /* (PWMC_CH3) Base Address*/
#define AT91C_BASE_PWMC_CH2  ((AT91PS_PWMC_CH) 	0xFFFCC240) /* (PWMC_CH2) Base Address*/
#define AT91C_BASE_PWMC_CH1  ((AT91PS_PWMC_CH) 	0xFFFCC220) /* (PWMC_CH1) Base Address*/
#define AT91C_BASE_PWMC_CH0  ((AT91PS_PWMC_CH) 	0xFFFCC200) /* (PWMC_CH0) Base Address*/
#define AT91C_BASE_PWMC      ((AT91PS_PWMC) 	0xFFFCC000) /* (PWMC) Base Address*/
#define AT91C_BASE_UDP       ((AT91PS_UDP) 	0xFFFB0000) /* (UDP) Base Address*/

/* ******************************************************************************/
/*               MEMORY MAPPING DEFINITIONS FOR AT91SAM7S512*/
/* ******************************************************************************/
/* ISRAM*/
#define AT91C_ISRAM	 ((char *) 	0x00200000) /* Internal SRAM base address*/
#define AT91C_ISRAM_SIZE	 ((unsigned int) 0x00010000) /* Internal SRAM size in byte (64 Kbytes)*/
/* IFLASH*/
#define AT91C_IFLASH	 ((char *) 	0x00100000) /* Internal FLASH base address*/
#define AT91C_IFLASH_SIZE	 ((unsigned int) 0x00080000) /* Internal FLASH size in byte (512 Kbytes)*/
#define AT91C_IFLASH_PAGE_SIZE	 ((unsigned int) 256) /* Internal FLASH Page Size: 256 bytes*/
#define AT91C_IFLASH_LOCK_REGION_SIZE	 ((unsigned int) 16384) /* Internal FLASH Lock Region Size: 16 Kbytes*/
#define AT91C_IFLASH_NB_OF_PAGES	 ((unsigned int) 2048) /* Internal FLASH Number of Pages: 2048 bytes*/
#define AT91C_IFLASH_NB_OF_LOCK_BITS	 ((unsigned int) 32) /* Internal FLASH Number of Lock Bits: 32 bytes*/
#endif /* __IAR_SYSTEMS_ICC__ */

