una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam7s512.h
AT91C_TC2_SR              EQU (0xFFFA00A0) ;- (TC2) Status Register
AT91C_TC2_RB              EQU (0xFFFA0098) ;- (TC2) Register B
AT91C_TC2_CV              EQU (0xFFFA0090) ;- (TC2) Counter Value
AT91C_TC2_CCR             EQU (0xFFFA0080) ;- (TC2) Channel Control Register
/* - ========== Register definition for TCB peripheral ========== */
AT91C_TCB_BMR             EQU (0xFFFA00C4) ;- (TCB) TC Block Mode Register
AT91C_TCB_BCR             EQU (0xFFFA00C0) ;- (TCB) TC Block Control Register
/* - ========== Register definition for PWMC_CH3 peripheral ========== */
AT91C_PWMC_CH3_CUPDR      EQU (0xFFFCC270) ;- (PWMC_CH3) Channel Update Register
AT91C_PWMC_CH3_CPRDR      EQU (0xFFFCC268) ;- (PWMC_CH3) Channel Period Register
AT91C_PWMC_CH3_CMR        EQU (0xFFFCC260) ;- (PWMC_CH3) Channel Mode Register
AT91C_PWMC_CH3_Reserved   EQU (0xFFFCC274) ;- (PWMC_CH3) Reserved
AT91C_PWMC_CH3_CCNTR      EQU (0xFFFCC26C) ;- (PWMC_CH3) Channel Counter Register
AT91C_PWMC_CH3_CDTYR      EQU (0xFFFCC264) ;- (PWMC_CH3) Channel Duty Cycle Register
/* - ========== Register definition for PWMC_CH2 peripheral ========== */
AT91C_PWMC_CH2_CUPDR      EQU (0xFFFCC250) ;- (PWMC_CH2) Channel Update Register
AT91C_PWMC_CH2_CPRDR      EQU (0xFFFCC248) ;- (PWMC_CH2) Channel Period Register
AT91C_PWMC_CH2_CMR        EQU (0xFFFCC240) ;- (PWMC_CH2) Channel Mode Register
AT91C_PWMC_CH2_Reserved   EQU (0xFFFCC254) ;- (PWMC_CH2) Reserved
AT91C_PWMC_CH2_CCNTR      EQU (0xFFFCC24C) ;- (PWMC_CH2) Channel Counter Register
AT91C_PWMC_CH2_CDTYR      EQU (0xFFFCC244) ;- (PWMC_CH2) Channel Duty Cycle Register
/* - ========== Register definition for PWMC_CH1 peripheral ========== */
AT91C_PWMC_CH1_CUPDR      EQU (0xFFFCC230) ;- (PWMC_CH1) Channel Update Register
AT91C_PWMC_CH1_CPRDR      EQU (0xFFFCC228) ;- (PWMC_CH1) Channel Period Register
AT91C_PWMC_CH1_CMR        EQU (0xFFFCC220) ;- (PWMC_CH1) Channel Mode Register
AT91C_PWMC_CH1_Reserved   EQU (0xFFFCC234) ;- (PWMC_CH1) Reserved
AT91C_PWMC_CH1_CCNTR      EQU (0xFFFCC22C) ;- (PWMC_CH1) Channel Counter Register
AT91C_PWMC_CH1_CDTYR      EQU (0xFFFCC224) ;- (PWMC_CH1) Channel Duty Cycle Register
/* - ========== Register definition for PWMC_CH0 peripheral ========== */
AT91C_PWMC_CH0_CUPDR      EQU (0xFFFCC210) ;- (PWMC_CH0) Channel Update Register
AT91C_PWMC_CH0_CPRDR      EQU (0xFFFCC208) ;- (PWMC_CH0) Channel Period Register
AT91C_PWMC_CH0_CMR        EQU (0xFFFCC200) ;- (PWMC_CH0) Channel Mode Register
AT91C_PWMC_CH0_Reserved   EQU (0xFFFCC214) ;- (PWMC_CH0) Reserved
AT91C_PWMC_CH0_CCNTR      EQU (0xFFFCC20C) ;- (PWMC_CH0) Channel Counter Register
AT91C_PWMC_CH0_CDTYR      EQU (0xFFFCC204) ;- (PWMC_CH0) Channel Duty Cycle Register
/* - ========== Register definition for PWMC peripheral ========== */
AT91C_PWMC_VR             EQU (0xFFFCC0FC) ;- (PWMC) PWMC Version Register
AT91C_PWMC_ISR            EQU (0xFFFCC01C) ;- (PWMC) PWMC Interrupt Status Register
AT91C_PWMC_IDR            EQU (0xFFFCC014) ;- (PWMC) PWMC Interrupt Disable Register
AT91C_PWMC_SR             EQU (0xFFFCC00C) ;- (PWMC) PWMC Status Register
AT91C_PWMC_ENA            EQU (0xFFFCC004) ;- (PWMC) PWMC Enable Register
AT91C_PWMC_IMR            EQU (0xFFFCC018) ;- (PWMC) PWMC Interrupt Mask Register
AT91C_PWMC_MR             EQU (0xFFFCC000) ;- (PWMC) PWMC Mode Register
AT91C_PWMC_DIS            EQU (0xFFFCC008) ;- (PWMC) PWMC Disable Register
AT91C_PWMC_IER            EQU (0xFFFCC010) ;- (PWMC) PWMC Interrupt Enable Register
/* - ========== Register definition for UDP peripheral ========== */
AT91C_UDP_TXVC            EQU (0xFFFB0074) ;- (UDP) Transceiver Control Register
AT91C_UDP_ISR             EQU (0xFFFB001C) ;- (UDP) Interrupt Status Register
AT91C_UDP_IDR             EQU (0xFFFB0014) ;- (UDP) Interrupt Disable Register
AT91C_UDP_CSR             EQU (0xFFFB0030) ;- (UDP) Endpoint Control and Status Register
AT91C_UDP_RSTEP           EQU (0xFFFB0028) ;- (UDP) Reset Endpoint Register
AT91C_UDP_ICR             EQU (0xFFFB0020) ;- (UDP) Interrupt Clear Register
AT91C_UDP_GLBSTATE        EQU (0xFFFB0004) ;- (UDP) Global State Register
AT91C_UDP_NUM             EQU (0xFFFB0000) ;- (UDP) Frame Number Register
AT91C_UDP_FADDR           EQU (0xFFFB0008) ;- (UDP) Function Address Register
AT91C_UDP_IER             EQU (0xFFFB0010) ;- (UDP) Interrupt Enable Register
AT91C_UDP_IMR             EQU (0xFFFB0018) ;- (UDP) Interrupt Mask Register
AT91C_UDP_FDR             EQU (0xFFFB0050) ;- (UDP) Endpoint FIFO Data Register

/* - ******************************************************************************/
/* -               PIO DEFINITIONS FOR AT91SAM7S512*/
/* - ******************************************************************************/
AT91C_PIO_PA0             EQU (1 <<  0) ;- Pin Controlled by PA0
AT91C_PA0_PWM0            EQU (AT91C_PIO_PA0) ;-  PWM Channel 0
AT91C_PA0_TIOA0           EQU (AT91C_PIO_PA0) ;-  Timer Counter 0 Multipurpose Timer I/O Pin A
AT91C_PIO_PA1             EQU (1 <<  1) ;- Pin Controlled by PA1
AT91C_PA1_PWM1            EQU (AT91C_PIO_PA1) ;-  PWM Channel 1
AT91C_PA1_TIOB0           EQU (AT91C_PIO_PA1) ;-  Timer Counter 0 Multipurpose Timer I/O Pin B
AT91C_PIO_PA10            EQU (1 << 10) ;- Pin Controlled by PA10
AT91C_PA10_DTXD           EQU (AT91C_PIO_PA10) ;-  DBGU Debug Transmit Data
AT91C_PA10_NPCS2          EQU (AT91C_PIO_PA10) ;-  SPI Peripheral Chip Select 2
AT91C_PIO_PA11            EQU (1 << 11) ;- Pin Controlled by PA11
AT91C_PA11_NPCS0          EQU (AT91C_PIO_PA11) ;-  SPI Peripheral Chip Select 0
AT91C_PA11_PWM0           EQU (AT91C_PIO_PA11) ;-  PWM Channel 0
AT91C_PIO_PA12            EQU (1 << 12) ;- Pin Controlled by PA12
AT91C_PA12_MISO           EQU (AT91C_PIO_PA12) ;-  SPI Master In Slave
AT91C_PA12_PWM1           EQU (AT91C_PIO_PA12) ;-  PWM Channel 1
AT91C_PIO_PA13            EQU (1 << 13) ;- Pin Controlled by PA13
AT91C_PA13_MOSI           EQU (AT91C_PIO_PA13) ;-  SPI Master Out Slave
AT91C_PA13_PWM2           EQU (AT91C_PIO_PA13) ;-  PWM Channel 2
AT91C_PIO_PA14            EQU (1 << 14) ;- Pin Controlled by PA14
AT91C_PA14_SPCK           EQU (AT91C_PIO_PA14) ;-  SPI Serial Clock
AT91C_PA14_PWM3           EQU (AT91C_PIO_PA14) ;-  PWM Channel 3
AT91C_PIO_PA15            EQU (1 << 15) ;- Pin Controlled by PA15
AT91C_PA15_TF             EQU (AT91C_PIO_PA15) ;-  SSC Transmit Frame Sync
AT91C_PA15_TIOA1          EQU (AT91C_PIO_PA15) ;-  Timer Counter 1 Multipurpose Timer I/O Pin A
AT91C_PIO_PA16            EQU (1 << 16) ;- Pin Controlled by PA16
AT91C_PA16_TK             EQU (AT91C_PIO_PA16) ;-  SSC Transmit Clock
AT91C_PA16_TIOB1          EQU (AT91C_PIO_PA16) ;-  Timer Counter 1 Multipurpose Timer I/O Pin B
AT91C_PIO_PA17            EQU (1 << 17) ;- Pin Controlled by PA17
AT91C_PA17_TD             EQU (AT91C_PIO_PA17) ;-  SSC Transmit data
AT91C_PA17_PCK1           EQU (AT91C_PIO_PA17) ;-  PMC Programmable Clock Output 1
AT91C_PIO_PA18            EQU (1 << 18) ;- Pin Controlled by PA18
AT91C_PA18_RD             EQU (AT91C_PIO_PA18) ;-  SSC Receive Data
AT91C_PA18_PCK2           EQU (AT91C_PIO_PA18) ;-  PMC Programmable Clock Output 2
AT91C_PIO_PA19            EQU (1 << 19) ;- Pin Controlled by PA19
AT91C_PA19_RK             EQU (AT91C_PIO_PA19) ;-  SSC Receive Clock
AT91C_PA19_FIQ            EQU (AT91C_PIO_PA19) ;-  AIC Fast Interrupt Input
AT91C_PIO_PA2             EQU (1 <<  2) ;- Pin Controlled by PA2
AT91C_PA2_PWM2            EQU (AT91C_PIO_PA2) ;-  PWM Channel 2
AT91C_PA2_SCK0            EQU (AT91C_PIO_PA2) ;-  USART 0 Serial Clock
AT91C_PIO_PA20            EQU (1 << 20) ;- Pin Controlled by PA20
AT91C_PA20_RF             EQU (AT91C_PIO_PA20) ;-  SSC Receive Frame Sync
AT91C_PA20_IRQ0           EQU (AT91C_PIO_PA20) ;-  External Interrupt 0
AT91C_PIO_PA21            EQU (1 << 21) ;- Pin Controlled by PA21
AT91C_PA21_RXD1           EQU (AT91C_PIO_PA21) ;-  USART 1 Receive Data
AT91C_PA21_PCK1           EQU (AT91C_PIO_PA21) ;-  PMC Programmable Clock Output 1
AT91C_PIO_PA22            EQU (1 << 22) ;- Pin Controlled by PA22
AT91C_PA22_TXD1           EQU (AT91C_PIO_PA22) ;-  USART 1 Transmit Data
AT91C_PA22_NPCS3          EQU (AT91C_PIO_PA22) ;-  SPI Peripheral Chip Select 3
AT91C_PIO_PA23            EQU (1 << 23) ;- Pin Controlled by PA23
AT91C_PA23_SCK1           EQU (AT91C_PIO_PA23) ;-  USART 1 Serial Clock
AT91C_PA23_PWM0           EQU (AT91C_PIO_PA23) ;-  PWM Channel 0
AT91C_PIO_PA24            EQU (1 << 24) ;- Pin Controlled by PA24
AT91C_PA24_RTS1           EQU (AT91C_PIO_PA24) ;-  USART 1 Ready To Send
AT91C_PA24_PWM1           EQU (AT91C_PIO_PA24) ;-  PWM Channel 1
AT91C_PIO_PA25            EQU (1 << 25) ;- Pin Controlled by PA25
AT91C_PA25_CTS1           EQU (AT91C_PIO_PA25) ;-  USART 1 Clear To Send
AT91C_PA25_PWM2           EQU (AT91C_PIO_PA25) ;-  PWM Channel 2
AT91C_PIO_PA26            EQU (1 << 26) ;- Pin Controlled by PA26
AT91C_PA26_DCD1           EQU (AT91C_PIO_PA26) ;-  USART 1 Data Carrier Detect
AT91C_PA26_TIOA2          EQU (AT91C_PIO_PA26) ;-  Timer Counter 2 Multipurpose Timer I/O Pin A
AT91C_PIO_PA27            EQU (1 << 27) ;- Pin Controlled by PA27
AT91C_PA27_DTR1           EQU (AT91C_PIO_PA27) ;-  USART 1 Data Terminal ready
AT91C_PA27_TIOB2          EQU (AT91C_PIO_PA27) ;-  Timer Counter 2 Multipurpose Timer I/O Pin B
AT91C_PIO_PA28            EQU (1 << 28) ;- Pin Controlled by PA28
AT91C_PA28_DSR1           EQU (AT91C_PIO_PA28) ;-  USART 1 Data Set ready
AT91C_PA28_TCLK1          EQU (AT91C_PIO_PA28) ;-  Timer Counter 1 external clock input
AT91C_PIO_PA29            EQU (1 << 29) ;- Pin Controlled by PA29
AT91C_PA29_RI1            EQU (AT91C_PIO_PA29) ;-  USART 1 Ring Indicator
AT91C_PA29_TCLK2          EQU (AT91C_PIO_PA29) ;-  Timer Counter 2 external clock input
AT91C_PIO_PA3             EQU (1 <<  3) ;- Pin Controlled by PA3
AT91C_PA3_TWD             EQU (AT91C_PIO_PA3) ;-  TWI Two-wire Serial Data
AT91C_PA3_NPCS3           EQU (AT91C_PIO_PA3) ;-  SPI Peripheral Chip Select 3
AT91C_PIO_PA30            EQU (1 << 30) ;- Pin Controlled by PA30
AT91C_PA30_IRQ1           EQU (AT91C_PIO_PA30) ;-  External Interrupt 1
AT91C_PA30_NPCS2          EQU (AT91C_PIO_PA30) ;-  SPI Peripheral Chip Select 2
AT91C_PIO_PA31            EQU (1 << 31) ;- Pin Controlled by PA31
AT91C_PA31_NPCS1          EQU (AT91C_PIO_PA31) ;-  SPI Peripheral Chip Select 1
AT91C_PA31_PCK2           EQU (AT91C_PIO_PA31) ;-  PMC Programmable Clock Output 2
AT91C_PIO_PA4             EQU (1 <<  4) ;- Pin Controlled by PA4
AT91C_PA4_TWCK            EQU (AT91C_PIO_PA4) ;-  TWI Two-wire Serial Clock
AT91C_PA4_TCLK0           EQU (AT91C_PIO_PA4) ;-  Timer Counter 0 external clock input
AT91C_PIO_PA5             EQU (1 <<  5) ;- Pin Controlled by PA5
AT91C_PA5_RXD0            EQU (AT91C_PIO_PA5) ;-  USART 0 Receive Data
AT91C_PA5_NPCS3           EQU (AT91C_PIO_PA5) ;-  SPI Peripheral Chip Select 3
AT91C_PIO_PA6             EQU (1 <<  6) ;- Pin Controlled by PA6
AT91C_PA6_TXD0            EQU (AT91C_PIO_PA6) ;-  USART 0 Transmit Data
AT91C_PA6_PCK0            EQU (AT91C_PIO_PA6) ;-  PMC Programmable Clock Output 0
AT91C_PIO_PA7             EQU (1 <<  7) ;- Pin Controlled by PA7
AT91C_PA7_RTS0            EQU (AT91C_PIO_PA7) ;-  USART 0 Ready To Send
AT91C_PA7_PWM3            EQU (AT91C_PIO_PA7) ;-  PWM Channel 3
AT91C_PIO_PA8             EQU (1 <<  8) ;- Pin Controlled by PA8
AT91C_PA8_CTS0            EQU (AT91C_PIO_PA8) ;-  USART 0 Clear To Send
AT91C_PA8_ADTRG           EQU (AT91C_PIO_PA8) ;-  ADC External Trigger
AT91C_PIO_PA9             EQU (1 <<  9) ;- Pin Controlled by PA9
AT91C_PA9_DRXD            EQU (AT91C_PIO_PA9) ;-  DBGU Debug Receive Data
AT91C_PA9_NPCS1           EQU (AT91C_PIO_PA9) ;-  SPI Peripheral Chip Select 1

